:PROPERTIES:
:ID:       FF2E7FC4-3E64-4791-B320-2B5A0CC852EA
:END:
#+title: clojure
#+HUGO_SECTION:main


*** clojure-cookbook
:LOGBOOK:
- Note taken on [2022-01-22 Sat 11:36] \\
  1-26 -- 1-27
CLOCK: [2022-01-22 Sat 11:10]--[2022-01-22 Sat 11:35] =>  0:25
- Note taken on [2022-01-20 Thu 14:14] \\
  start: 1-21 1-26
CLOCK: [2022-01-20 Thu 13:27]--[2022-01-20 Thu 14:57] =>  1:30
CLOCK: [2022-01-19 Wed 21:41]--[2022-01-19 Wed 22:31] =>  0:50
:END:
This a source of information I found very cool, ergo I would finish.
* Metalearning
:LOGBOOK:
- Note taken on [2022-02-09 Wed 17:37] \\
  research#1 and plan#1 done.
  Figured a first draft of the first 2 stages of learning
  Approximate 5 days of work planned
CLOCK: [2022-02-09 Wed 13:30]--[2022-02-09 Wed 17:37] =>  4:07
:END:

*** 1. Start up: Clojure for brave and true
:LOGBOOK:
CLOCK: [2022-02-16 Wed 20:41]--[2022-02-19 Sat 12:15] => 63:34
CLOCK: [2022-02-13 Sun 22:56]--[2022-02-13 Sun 23:12] =>  0:16
CLOCK: [2022-02-10 Thu 21:06]--[2022-02-10 Thu 22:06] => 1:00 
CLOCK: [2022-02-10 Thu 02:09]--[2022-02-10 Thu 4:09] => 2:00
- Note taken on [2022-02-09 Wed 19:31] \\
  Setting up the Track chapter titles.
CLOCK: [2022-02-09 Wed 19:09]--[2022-02-09 Wed 19:31] =>  0:22
CLOCK: [2022-02-09 Wed 18:38]--[2022-02-09 Wed 18:53] =>  0:15
:END:
This stage I want to get familiar with clojure and some implementations, so I could perform tasks =properly= with clojure.
+ Main book/resource:  [[https://www.braveclojure.com/clojure-for-the-brave-and-true/][clojure for the brave and true]]
+ Side Resources:
  + [[http://iloveponies.github.io/120-hour-epic-sax-marathon/index.html][functional programming in clojure]]
  + Clojure Programming
  + [[https://kimh.github.io/clojure-by-example/#about-this-page][clojure by example]]
  + [[https://aphyr.com/posts/301-clojure-from-the-ground-up-welcome][clojure from ground up]]
+ Practices:
  + HackerRank
  + 4clojure [[https://4clojure.oxal.org/][4clojure]]
    [[https://github.com/4clojure/4clojure][4clojure repo]]
  + [[http://clojurekoans.com/][clojure koan]]
    will meet compile error, and that's the file needed to be complete
  + [[http://www.parens-of-the-dead.com/][Parens of the Dead]]
    I don't exactly know what is it, but it seems very fun.
+ How the study work.
  + Scope:
    + Measure of end: The book Clojure for brave and true is finished.
    + Capability:
      I should be able to write anything stupidly with clojure, with full familiarity of a =complete toolbox=.
      I should have already a favourable =writing style= and some killer function usage.
      I should have a =complete develop process= using cider and Emacs.
  + Method:
    + Machines:
      later to fill
    + Methods:
      + Feynman technique
      + Overstudy
      + Active Recall
      + Blogging through the treasures
        Tutorial from newbie for newbie.    
*** 2. Getting going: The Joy of clojure
:LOGBOOK:
CLOCK: [2022-02-15 Tue 21:09]--[2022-02-15 Tue 22:09] => 1:00
CLOCK: [2022-02-13 Sun 23:15]--[2022-02-13 Sun 23:45] => 0:30
:END:
This stage I want to really get into some phylosophy of clojure
+ Main book/resource: the joy of clojure
+ Side resources:
  + clojure in action
  + Clojure For machine learning
  + Rick Hickey talks
+ Practices:
  + Following practices from privious sources
  + Projects
    + A Website
  + Algorithms
    + Neural Network
    + 聚类和比较算法。找个脑电数据集
  + from resources.
+ How the study work.
  + Scope
    + Measure of end: The book The Joy of Clojure is finished
    + Capability:
      + I should know the phylosophy of Clojure, and why they are good
      + I should know at least 1 implementation of each phylosophy.
      + I should know when, at what tasks clojure works better, and when it don't work good
      + I should be able to write a performing web server
      + I should be able to write a performing neural network
  + Method:
    + Machines:
      later to fill
    + Methods:
      + Feynman technique
      + Overstudy
      + Active Recall
      + Blogging through the treasures
        Tutorial from newbie for newbie.
** Types
:LOGBOOK:
CLOCK: [2022-01-05 Wed 01:06]--[2022-01-05 Wed 21:50] => 20:44
:END:
** Web development
:LOGBOOK:
CLOCK: [2022-02-07 Mon 18:10]--[2022-02-09 Wed 13:30] => 43:20
:END:
